// 打包: gradle clean build  -Denv=production
// 部署: gradle clean deploy -Denv=production

////////////////////////////////////////////////////////////////////////////////////
//                               定义所有环境下都有的通用配置
////////////////////////////////////////////////////////////////////////////////////
//environments {
//  usedByAllEnvironments {
        deploy {
            host     = '127.0.0.1'
            username = 'root'
            password = 'root'
        }

        database {
            host     = '127.0.0.1'
            username = 'root'
            password = 'root'
        }

        redis {
            host = '127.0.0.1'
            port = 6379
            password = ''
            database = 0
            timeout  = 2000
        }

        // 应用的 ID 和 key，用于生成身份认证的 token
        appId  = 'Default_ID'
        appKey = 'Default_Key'

        idWorker = 0                    // ID 生成器的 ID，范围是 [0, 1023]
        thymeleafCacheable = true       // thymeleaf 默认使用缓存提高效率
        dataDirectory    = '/ebag/data' // 数据文件目录
        tempDirectory    = '/ebag/temp' // 临时文件目录，例如存储上传的临时文件，里面的文件可以超过几天不放问可以用 crontab 自动删除
//  }
//}

////////////////////////////////////////////////////////////////////////////////////
//                定义不同环境下特有的配置，同路径时覆盖上面定义的通用配置
////////////////////////////////////////////////////////////////////////////////////
environments {
    /*-----------------------------------------------------------------------------|
     |                                 开发环境配置                                 |
     |----------------------------------------------------------------------------*/
    // 本机开发环境配置
    development {
        thymeleafCacheable = false // 开发环境下 thymeleaf 不缓存页面
    }

    /*-----------------------------------------------------------------------------|
     |                                 测试环境配置                                 |
     |----------------------------------------------------------------------------*/
    test1 {
        idWorker = 0
    }

    test2 {
        idWorker = 1
    }
}
